<a href="https://colab.research.google.com/github/parikannappan/python_learning/blob/master/dropna_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [ ]:
df1 = pd.DataFrame({'one': [np.nan, np.nan, np.nan, 0.1],
                   'two': [0.0,  1.212112, -0.173215, 3.5655],
                   'three': [0.0, -0.706771, -1.039575, 4.7786],
                    'four': [0.0, 0.563, 0.2864,  0.34345]})

In [ ]:
df1

   one       two     three     four
0  NaN  0.000000  0.000000  0.00000
1  NaN  1.212112 -0.706771  0.56300
2  NaN -0.173215 -1.039575  0.28640
3  0.1  3.565500  4.778600  0.34345

In [ ]:
df1.dropna(axis=0)

   one     two   three     four
3  0.1  3.5655  4.7786  0.34345

In [2]:
df2 = pd.DataFrame({'one': [np.nan, np.nan, np.nan, 0.1],
                   'two': [0.0,  2.212112, -0.1732, 3.5655],
                   'three': [0.0, -0.067, -3.0395, 4.7786],
                    'four': [0.0, 0.563, 0.2864,  0.34345]})

In [3]:
df2.dropna(axis=1)

        two   three     four
0  0.000000  0.0000  0.00000
1  2.212112 -0.0670  0.56300
2 -0.173200 -3.0395  0.28640
3  3.565500  4.7786  0.34345